-- База даних Академія (Academy) містить інформацію про співробітників та внутрішній порядок академії. 
-- Викладачі, які читають лекції в академії, занесені до таблиці Викладачі (Teachers), в якій зібрано основну інформацію: 
-- ім’я, прізвище, дані про зарплату, дата прийому на роботу. Також у базі даних є інформація про групи, 
-- яка зберігається в таблиці Групи (Groups). Дані про факультети та кафедри містяться в таблицях Факультети (Faculties) 
-- та Кафедри (Departments) відповідно. 
==== Кафедри (Departments) 
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор кафедри. 
-- 	▷ Тип даних — int. 
-- 	▷ Автоприріст. 
-- 	▷ Не містить null-значення. 
-- 	▷ Первинний ключ. 
-- ■ Фінансування (Financing). Фонд фінансування кафедри. 
-- 	▷ Тип даних — money. 
-- 	▷ Не містить null-значення. 
-- 	▷ Не може бути менше, ніж 0. 
-- 	▷ Значення за замовчуванням — 0. 
-- ■ Назва (Name). Назва кафедри. 
-- 	▷ Тип даних — varchar(100). 
-- 	▷ Не містить null-значення. 
-- 	▷ Не може бути порожньою. 
-- 	▷ Має бути унікальною.

CREATE TABLE DEPARTMENTS (
    ID SERIAL PRIMARY KEY CHECK (ID > 0),
    FINANCING INT NOT NULL DEFAULT 0 CHECK (FINANCING >= 0),
    NAME VARCHAR(100) NOT NULL UNIQUE CHECK (NAME <> '')
);

INSERT INTO DEPARTMENTS (FINANCING, Name) VALUES
	(150000, 'Кафедра інформатики'),
	(120000, 'Кафедра математики'),
	(130000, 'Кафедра фізики'),
	(110000, 'Кафедра хімії'),
	(90000, 'Кафедра біології'),
	(80000, 'Кафедра історії'),
	(95000, 'Кафедра філології'),
	(105000, 'Кафедра економіки'),
	(115000, 'Кафедра менеджменту'),
	(97000, 'Кафедра психології'),
	(86000, 'Кафедра педагогіки'),
	(102000, 'Кафедра права'),
	(98000, 'Кафедра журналістики'),
	(140000, 'Кафедра програмування'),
	(88000, 'Кафедра соціології'),
	(125000, 'Кафедра дизайну'),
	(112000, 'Кафедра електроніки'),
	(94000, 'Кафедра екології'),
	(150000, 'Кафедра штучного інтелекту'),
	(108000, 'Кафедра філософії');

SELECT *
FROM DEPARTMENTS;

--------- Факультети(Faculties)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор факультету. 
-- 	▷ Тип даних — int. 
-- 	▷ Автоприріст. 
-- 	▷ Не містить null-значення. 
-- 	▷ Первинний ключ. 
-- ■ Декан (Dean). Декан факультету. 
-- 	▷ Тип даних — varchar(255). 
-- 	▷ Не містить null-значення. 
-- 	▷ Не може бути порожнім. 
-- ■ Назва (Name). Назва факультету. 
-- 	▷ Тип даних — varchar(100). 
-- 	▷ Не містить null-значення. 
-- 	▷ Не може бути порожньою. 
-- 	▷ Має бути унікальною.

CREATE TABLE FACULTIES (
    ID SERIAL PRIMARY KEY,
    DEAN VARCHAR(255) NOT NULL CHECK (DEAN <> ''),
	NAME VARCHAR(100) NOT NULL UNIQUE CHECK (NAME <> '')
);

INSERT INTO FACULTIES (DEAN, NAME) VALUES
('Іваненко Іван Іванович', 'Факультет інформаційних технологій'),
('Петренко Сергій Олегович', 'Факультет прикладної математики'),
('Шевченко Андрій Михайлович', 'Факультет природничих наук'),
('Гаврилюк Оксана Іванівна', 'Факультет гуманітарних наук'),
('Дмитрук Віктор Васильович', 'Факультет економіки'),
('Бойко Наталія Михайлівна', 'Факультет менеджменту'),
('Сидоренко Микола Андрійович', 'Факультет права'),
('Кравченко Марія Петрівна', 'Факультет журналістики'),
('Лисенко Юрій Михайлович', 'Факультет психології'),
('Гончар Тетяна Ігорівна', 'Факультет педагогіки'),
('Ткаченко Олександр Степанович', 'Факультет історії'),
('Романенко Ірина Анатоліївна', 'Факультет біології'),
('Олійник Богдан Володимирович', 'Факультет хімії'),
('Захаренко Олексій Ігорович', 'Факультет фізики'),
('Савченко Дарина Іванівна', 'Факультет філології'),
('Клименко Вадим Сергійович', 'Факультет дизайну'),
('Павленко Олег Михайлович', 'Факультет екології'),
('Мельник Оксана Володимирівна', 'Факультет соціології'),
('Рибак Артем Петрович', 'Факультет електроніки'),
('Юрченко Галина Степанівна', 'Факультет педагогічної освіти'),
('Мартинюк Олег Ігорович', 'Факультет міжнародних відносин'),
('Денисенко Анна Віталіївна', 'Факультет мистецтв'),
('Левченко Петро Іванович', 'Факультет архітектури'),
('Федоренко Дмитро Михайлович', 'Факультет програмування'),
('Ісаєнко Катерина Сергіївна', 'Факультет кібербезпеки'),
('Волков Павло Андрійович', 'Факультет штучного інтелекту'),
('Мазур Алла Володимирівна', 'Факультет географії'),
('Білан Тетяна Олегівна', 'Факультет туризму'),
('Косенко Владислав Іванович', 'Факультет бізнесу'),
('Тимченко Дар’я Юріївна', 'Факультет культурології');

SELECT *
FROM FACULTIES;

==== Групи (Groups) 
■ Ідентифікатор (Id). Унікальний ідентифікатор групи. 
	▷ Тип даних — int. 
	▷ Автоприріст. 
	▷ Не містить null-значення. 
	▷ Первинний ключ. 
■ Назва (Name). Назва групи. 
	▷ Тип даних — varchar(10). 
	▷ Не містить null-значення. 
	▷ Не може бути порожньою. 
	▷ Має бути унікальною. 
■ Рейтинг (Rating). Рейтинг групи. 
	▷ Тип даних — int. 
	▷ Не містить null-значення. 
	▷ Має бути в діапазоні від 0 до 5. 
■ Курс (Year). Курс (рік), на якому навчається група. 
	▷ Тип даних — int. 
	▷ Не містить null-значення. 
	▷ Має бути в діапазоні від 1 до 5.

CREATE TABLE GROUPS(
	GROUPS_ID SERIAL PRIMARY KEY,
	NAME VARCHAR(10) NOT NULL UNIQUE CHECK (NAME <> ''),
	RATING INT NOT NULL CHECK (RATING BETWEEN 0 AND 5),
	YEAR INT NOT NULL CHECK (YEAR BETWEEN 0 AND 5)
);

INSERT INTO GROUPS (NAME, RATING, YEAR) VALUES
('GRP101', 5, 1),
('GRP102', 4, 1),
('GRP103', 3, 1),
('GRP104', 2, 2),
('GRP105', 1, 2),
('GRP106', 0, 2),
('GRP107', 5, 3),
('GRP108', 4, 3),
('GRP109', 3, 3),
('GRP110', 2, 4),
('GRP111', 1, 4),
('GRP112', 0, 4),
('GRP113', 5, 5),
('GRP114', 4, 5),
('GRP115', 3, 5),
('GRP116', 2, 1),
('GRP117', 1, 1),
('GRP118', 0, 1),
('GRP119', 5, 2),
('GRP120', 4, 2),
('GRP121', 3, 2),
('GRP122', 2, 3),
('GRP123', 1, 3),
('GRP124', 0, 3),
('GRP125', 5, 4),
('GRP126', 4, 4),
('GRP127', 3, 4),
('GRP128', 2, 5),
('GRP129', 1, 5),
('GRP130', 0, 5);

SELECT *
FROM GROUPS;

-- Викладачі(Teachers) 
■ Ідентифікатор (Id). Унікальний ідентифікатор викладача. 
	▷ Тип даних — int. 
	▷ Автоприріст. 
	▷ Не містить null-значення. 
	▷ Первинний ключ. 
■ Дата працевлаштування (EmploymentDate). Дата працевлаштування викладача. 
	▷ Тип даних — date. 
	▷ Не містить null-значення. 
	▷ Не може бути менше 01.01.1990. 
■ Асистент (IsAssistant). Чи є викладач асистентом. 
	▷ Тип даних — BOOLEAN. 
	▷ Не містить null-значення. 
	▷ Значення за замовчуванням — 0. 
■ Професор (IsProfessor). Чи є викладач професором. 
	▷ Тип даних — BOOLEAN. 
	▷ Не містить null-значення. 
	▷ Значення за замовчуванням — 0. 
■ Ім’я (Name). Ім’я викладача. 
	▷ Тип даних — TEXT. 
	▷ Не містить null-значення. 
	▷ Не може бути порожнє. 
■ Посада (Position). Посада викладача. 
	▷ Тип даних — TEXT. 
	▷ Не містить null-значення. 
	▷ Не може бути порожньою. 
■ Надбавка (Premium). Надбавка викладача. 
	▷ Тип даних — INT. 
	▷ Не містить null-значення. 
	▷ Не може бути менше, ніж 0. 
	▷ Значення за замовчуванням — 0. 
■ Ставка (Salary). Ставка викладача. 
	▷ Тип даних — INT. 
	▷ Не містить null-значення. 
	▷ Не може бути меншою або дорівнювати 0. 
■ Прізвище (Surname). Прізвище викладача. 
	▷ Тип даних — TEXT.
	▷ Не містить null-значення. 
	▷ Не може бути порожнє.

CREATE TABLE TEACHERS (
    ID SERIAL PRIMARY KEY,
    EMPLOYMENT_DATE DATE NOT NULL CHECK (EMPLOYMENT_DATE >= '1990-01-01'),
    IS_ASSISTANT BOOLEAN NOT NULL DEFAULT FALSE,
    IS_PROFESSOR BOOLEAN NOT NULL DEFAULT FALSE,
    NAME TEXT NOT NULL CHECK (NAME <> ''),
    POSITION TEXT NOT NULL CHECK (POSITION <> ''),
    PREMIUM INT NOT NULL DEFAULT 0 CHECK (PREMIUM >= 0),
    SALARY INT NOT NULL CHECK (SALARY > 0),
    SURNAME TEXT NOT NULL CHECK (SURNAME <> '')
);

INSERT INTO TEACHERS (EMPLOYMENT_DATE, IS_ASSISTANT, IS_PROFESSOR, NAME, POSITION, PREMIUM, SALARY, SURNAME) VALUES
('2000-09-01', FALSE, TRUE, 'Іван', 'Професор', 500, 5000, 'Іваненко'),
('2005-03-15', TRUE, FALSE, 'Олександр', 'Асистент', 200, 3000, 'Петренко'),
('2010-08-20', FALSE, FALSE, 'Марія', 'Старший викладач', 300, 4000, 'Шевченко'),
('1998-01-10', FALSE, TRUE, 'Андрій', 'Професор', 600, 5500, 'Гаврилюк'),
('2012-05-30', TRUE, FALSE, 'Оксана', 'Асистент', 150, 2800, 'Дмитрук'),
('2008-11-22', FALSE, TRUE, 'Віктор', 'Професор', 450, 4800, 'Бойко'),
('2015-02-17', TRUE, FALSE, 'Наталія', 'Асистент', 100, 2600, 'Сидоренко'),
('2003-06-05', FALSE, TRUE, 'Микола', 'Професор', 550, 5200, 'Кравченко'),
('2001-09-12', FALSE, FALSE, 'Марія', 'Старший викладач', 350, 4000, 'Лисенко'),
('2011-04-18', TRUE, FALSE, 'Тетяна', 'Асистент', 180, 2900, 'Гончар'),
('2002-07-22', FALSE, TRUE, 'Олег', 'Професор', 600, 5600, 'Ткаченко'),
('2009-03-19', TRUE, FALSE, 'Аліна', 'Асистент', 120, 2700, 'Романенко'),
('2004-12-01', FALSE, TRUE, 'Сергій', 'Професор', 500, 5000, 'Олійник'),
('2013-08-14', TRUE, FALSE, 'Ірина', 'Асистент', 100, 2500, 'Захаренко'),
('2006-05-11', FALSE, TRUE, 'Павло', 'Професор', 550, 5200, 'Савченко'),
('2007-01-09', FALSE, FALSE, 'Валентина', 'Старший викладач', 300, 4000, 'Клименко'),
('2001-11-23', TRUE, FALSE, 'Олексій', 'Асистент', 150, 2800, 'Павленко'),
('1999-06-18', FALSE, TRUE, 'Дмитро', 'Професор', 600, 5500, 'Мельник'),
('2014-02-27', TRUE, FALSE, 'Світлана', 'Асистент', 100, 2600, 'Рибак'),
('2000-10-03', FALSE, TRUE, 'Юрій', 'Професор', 500, 5000, 'Юрченко'),
('2005-07-15', TRUE, FALSE, 'Анастасія', 'Асистент', 120, 2700, 'Мартинюк'),
('2008-09-30', FALSE, TRUE, 'Володимир', 'Професор', 550, 5200, 'Денисенко'),
('2011-12-12', TRUE, FALSE, 'Ганна', 'Асистент', 150, 2800, 'Левченко'),
('2003-03-03', FALSE, TRUE, 'Роман', 'Професор', 600, 5500, 'Федоренко'),
('2006-06-25', TRUE, FALSE, 'Катерина', 'Асистент', 100, 2600, 'Ісаєнко'),
('2007-08-19', FALSE, TRUE, 'Петро', 'Професор', 500, 5000, 'Волков'),
('2002-05-14', TRUE, FALSE, 'Алла', 'Асистент', 120, 2700, 'Мазур'),
('2009-09-05', FALSE, TRUE, 'Тарас', 'Професор', 550, 5200, 'Білан'),
('2010-11-21', TRUE, FALSE, 'Владислав', 'Асистент', 150, 2800, 'Косенко'),
('2001-02-02', FALSE, TRUE, 'Дар’я', 'Професор', 600, 5500, 'Тимченко'),
('2004-04-18', TRUE, FALSE, 'Ігор', 'Асистент', 100, 2600, 'Іваненко'),
('2006-07-07', FALSE, TRUE, 'Олена', 'Професор', 500, 5000, 'Петренко'),
('2013-01-11', TRUE, FALSE, 'Сергій', 'Асистент', 120, 2700, 'Шевченко'),
('2008-08-29', FALSE, TRUE, 'Марина', 'Професор', 550, 5200, 'Гаврилюк'),
('2010-03-17', TRUE, FALSE, 'Андрій', 'Асистент', 150, 2800, 'Дмитрук'),
('2002-12-06', FALSE, TRUE, 'Ірина', 'Професор', 600, 5500, 'Бойко'),
('2005-05-05', TRUE, FALSE, 'Вікторія', 'Асистент', 100, 2600, 'Сидоренко'),
('2001-09-09', FALSE, TRUE, 'Микола', 'Професор', 500, 5000, 'Кравченко'),
('2007-02-28', TRUE, FALSE, 'Тетяна', 'Асистент', 120, 2700, 'Лисенко'),
('2009-06-14', FALSE, TRUE, 'Олег', 'Професор', 550, 5200, 'Гончар'),
('2011-10-20', TRUE, FALSE, 'Аліна', 'Асистент', 150, 2800, 'Ткаченко'),
('2003-12-12', FALSE, TRUE, 'Сергій', 'Професор', 600, 5500, 'Романенко'),
('2006-01-03', TRUE, FALSE, 'Оксана', 'Асистент', 100, 2600, 'Олійник'),
('2008-04-08', FALSE, TRUE, 'Павло', 'Професор', 500, 5000, 'Захаренко'),
('2010-07-11', TRUE, FALSE, 'Дарина', 'Асистент', 120, 2700, 'Савченко'),
('2002-02-20', FALSE, TRUE, 'Вадим', 'Професор', 550, 5200, 'Клименко'),
('2005-09-15', TRUE, FALSE, 'Олександр', 'Асистент', 150, 2800, 'Павленко'),
('2001-03-17', FALSE, TRUE, 'Дмитро', 'Професор', 600, 5500, 'Мельник'),
('2007-11-01', TRUE, FALSE, 'Анна', 'Асистент', 100, 2600, 'Рибак'),
('2008-08-08', FALSE, TRUE, 'Юрій', 'Професор', 500, 5000, 'Юрченко'),
('2010-12-12', TRUE, FALSE, 'Анастасія', 'Асистент', 120, 2700, 'Мартинюк'),
('2002-01-01', FALSE, TRUE, 'Володимир', 'Професор', 550, 5200, 'Денисенко'),
('2005-05-05', TRUE, FALSE, 'Ганна', 'Асистент', 150, 2800, 'Левченко'),
('2001-09-09', FALSE, TRUE, 'Роман', 'Професор', 600, 5500, 'Федоренко'),
('2007-07-07', TRUE, FALSE, 'Катерина', 'Асистент', 100, 2600, 'Ісаєнко'),
('2008-08-08', FALSE, TRUE, 'Петро', 'Професор', 500, 5000, 'Волков'),
('2010-10-10', TRUE, FALSE, 'Алла', 'Асистент', 120, 2700, 'Мазур'),
('2002-02-02', FALSE, TRUE, 'Тарас', 'Професор', 550, 5200, 'Білан'),
('2005-05-05', TRUE, FALSE, 'Владислав', 'Асистент', 150, 2800, 'Косенко');

SELECT *
FROM TEACHERS;

-- Завдання 2
-- Для бази даних Академія створіть такі запити:
-- 1. Вивести таблицю кафедр, але розташувати її поля у зворотному порядку.
SELECT NAME, FINANCING, ID 	
FROM Departments;

-- 2. Вивести назви груп та їх рейтинги з уточненнями до назв полів відповідно до назви таблиці.
SELECT NAME AS "Назва групи з таблиці GROUPS", RATING AS "Рейтинг групи з таблиці GROUPS"
FROM GROUPS;

SELECT *
FROM TEACHERS;

-- 3. Вивести для викладачів їх прізвища, відсоток ставки по відношенню до надбавки та відсоток ставки по відношенню до
-- зарплати (сума ставки та надбавки).
SELECT 
    SURNAME AS "Прізвище вчителя",
    PREMIUM * 100 / SALARY || '%' AS "Ставка/надбавка",
	PREMIUM * 100 / (PREMIUM + SALARY) || '%' AS "Ставка/зарплата"
FROM TEACHERS;

-- 4. Вивести таблицю факультетів одним полем у такому форматі: «The dean of faculty [faculty] is [dean].».
SELECT 
    'Декан ' || NAME || ' is ' || DEAN || '.' AS faculty_info
FROM FACULTIES;

-- 5. Вивести прізвища професорів, ставка яких перевищує 5400.
SELECT SURNAME, SALARY
FROM TEACHERS
WHERE IS_PROFESSOR = TRUE AND SALARY > 5400;

-- 6. Вивести назви кафедр, фонд фінансування яких менший, ніж 90000 або більший за 120000.
SELECT NAME
FROM DEPARTMENTS
WHERE FINANCING < 90000 OR FINANCING > 120000;

-- 7. Вивести назви факультетів, окрім факультету «Факультет фізики».
SELECT NAME
FROM FACULTIES
WHERE NAME <> 'Факультет фізики';

-- 8. Вивести прізвища та посади викладачів, які не є професорами.
SELECT SURNAME, POSITION
FROM TEACHERS
WHERE IS_PROFESSOR = FALSE;

-- 9. Вивести прізвища, посади, ставки та надбавки асистентів, надбавка яких у діапазоні від 160 до 550.
SELECT SURNAME, POSITION, SALARY, PREMIUM
FROM TEACHERS
WHERE IS_ASSISTANT = TRUE AND PREMIUM BETWEEN 160 AND 550;

-- 10. Вивести прізвища та ставки асистентів.
SELECT SURNAME, SALARY
FROM TEACHERS
WHERE IS_ASSISTANT = TRUE;

-- 11. Вивести прізвища та посади викладачів, які були прийняті на роботу до 01.01.2000.
SELECT SURNAME, POSITION ----, *
FROM TEACHERS
WHERE EMPLOYMENT_DATE < '2000-01-01';

-- 12. Вивести назви кафедр, які в алфавітному порядку розміщені до кафедри «Software Development». 
-- Виведене поле назвіть «Name of Department».
SELECT NAME AS "Name of Department"
FROM DEPARTMENTS
WHERE NAME < 'Кафедра фізики'
ORDER BY NAME;

-- 13. Вивести прізвища асистентів із зарплатою (сума ставки та надбавки) не більше 2800.
SELECT SURNAME --, *
FROM TEACHERS
WHERE IS_ASSISTANT = TRUE AND (SALARY + PREMIUM) <= 2800;
  
-- 14. Вивести назви груп 5-го курсу з рейтингом у діапазоні від 2 до 4.
SELECT NAME
FROM GROUPS
WHERE YEAR = 5 AND RATING BETWEEN 2 AND 4;

-- 15. Вивести прізвища асистентів зі ставкою менше, ніж 550 або надбавкою менше, ніж 200.
SELECT SURNAME
FROM TEACHERS
WHERE IS_ASSISTANT = TRUE AND (SALARY < 550 OR PREMIUM < 200);