# Рівень 1 — базові навички
# Напишіть програму, яка приймає від користувача число n і виводить усі числа від 1 до n, що діляться на 3.
# n = 10
# for i in range(1, n + 1):
#     if i % 3 == 0:
#         print(i)
#
# # Напишіть програму, яка приймає два рядки і виводить найдовший з них.
# s1 = 'апишіть програму, яка приймає рядок і підраховує кількість голосних літер (a, e, i, o, u або українські а, е, і, о, у, я, ю, є, ї)'
# s2 = 'апишіть програму, яка перевіряє, чи є введене число парним і кратним 5 одночасно.'
#
# if len(s1) > len(s2):
#     print(s1)
# else:
#     print(s2)

# # Напишіть програму, яка приймає рядок і підраховує кількість голосних літер (a, e, i, o, u або українські а, е, і, о, у, я, ю, є, ї).
# s = {'a', 'e', 'i', 'o', 'u', 'а', 'е', 'і', 'о', 'у', 'я', 'ю', 'є', 'ї'}
# s1 = 'апишіть програму, яка приймає рядок і підраховує кількість голосних літер (a, e, i, o, u або українські а, е, і, о, у, я, ю, є, ї)'
# count = 0
# for char in s1:
#     if char.lower() in s:
#         count += 1
# print(count)


# Рівень 3 — функції
# Напишіть функцію, яка приймає число і повертає True, якщо воно є простим.
# def prime(number):
#     if number != 1:
#         for i in range(2, number):
#             if number % i == 0:
#                 return False
#         return True
#     else:
#         return False
#
# print(prime(100))
# print(prime(17))


# Напишіть програму, яка приймає список чисел і створює новий список, що містить лише числа, більші за 10.
# Неправильно:
numbers = [1, 2, 24, 100, 5, 7, 67, 34, 3]

for num in numbers:
    if num <= 10:
        numbers.remove(num)
print(numbers)

class Book:
    def __init__(self, name):
        self.name = name


class Library:
    def __init__(self):
        self.books = []










